package com.pb.karpjuk.hw7;

public interface ManClothes {
    default void dressMan() {
        System.out.println("Одягнути чоловіка");
    }
}

//Создать интерфейсы
//ManClothes (мужская одежда) c методом dressMan (одеть мужчину)
