package com.pb.karpjuk.hw7;

public interface WomenClothes {
    default void dressWomen() {
        System.out.println("Одягнути жінку");
    }
}

//Создать интерфейсы
//WomenClothes (женская оджеда) с методом dressWomen (одеть женщину).
